# Создать 3 класса:
# Salad, Main_dish, Drink

# в этих классах создать поля name(строка), price(инт), dish_of_the_day(булеан)

# так же в этих классах создать функцию show_price, которая будет 
# выводить на экран стоимость блюда в рублях. 
# При этом, если блюдо является блюдом дня, то из стоимости вычесть 50 рублей

# создать по 3 объекта каждого из классов с разным блюдом и добавить в лист menu

# написать функцию print_menu, с аргументом нашего листа меню - menu,
# используя for пройтись по всему листу и вывести на экран меню для клиента
# (название каждого блюда и стоимость)

# для вывода на экран использовать функцию print_menu, оформить по усмотрению, но так, чтобы пользователю было понятно
