# Создать класс Student с полями degree (str), year (int), university_name (str)

# Создать в этом классе функцию show_info(), котрая будет выводить в
# консоль информацию о студенте в понятном пользователю виде

# Далее при помощи нескольких функций (на своё усмотрение) и понятной логики
# создать бесконечный луп while,
# который будет предлагать пользователю  1- ввести нового студента,
# 2 - посмотреть о всех студентах инфо, 3 - выйти из программы

# студентов сохранять в листе student_list и выводить на экран используя for
# и внутреннюю функцию show_info() 

# постараться сделать так, чтобы всё было разложено по функциям и программа
# запускалась лишь при помощи 1 функции main_program()