# Можно писать код под каждым заданием

# 1) при помощи for вывести на экран числа от -100 до 100 (включительно)


# 2) при помощи while вывести на экран числа от -25 до 120 (включительно)


# 3) при помощи for вывести на экран
# только четные числа от 2 до 20 (включительно), использовать continue


# 4) при помощи while вывести на экран
# только нечетные числа от 3 до 30 (включительно), использовать continue


# 5) создать лист с пятью именами, при помощи for пройтись
# по списку и сделать break на имени Ivan (сделать так, чтобы это имя было не в конце)


# 6) при помощи while бесконечно просить пользователя вводить числа
# и выйти из лупа при помощи break только если пользователь ввёл 13
